{
    "fish": [
        {
            "id": 0,
            "name": "Piece of junk",
            "subtitle": "this is not a fish",
            "image": {"image": "trash",
                "alt": "A crumpled up soda can. It's a light blue and honestly wasn't modeled after a specific brand."},
            "flavor": "A piece of junk you fished up. You might want to get a better fishing rod or bait to catch actual fish in this area...",
            "rarity": 0,
            "size": "small",
            "price": 0.0
        },
        {
            "id": 1,
            "name": "Bluegill",
            "subtitle": "Lepomis macrochirus",
            "image": {"image": "bluegill",
                "alt": "Bluegill - a small fish and the first one to get a sprite."},
            "flavor": "bluegills are a pretty common fish. though their gills aren't /that/ blue, they're surprisingly colorful.",
            "rarity": 0,
            "size": "small",
            "price": 1.20
        }, 
        {
            "id": 2,
            "name": "Pumpkinseed",
            "subtitle": "Lepomis gibbosus",
            "image": {"image": "pumpkinseed",
                "alt": "Pumpkinseed - this is literally a bluegill reskin"},
            "flavor": "pumpkinseeds are apparently \"pumpkin seed shaped\", but this one looks pretty fish shaped. maybe there's a more pumpkin seed shaped one out there...",
            "rarity": 0,
            "size": "small",
            "price": 2.20
        },
        {
            "id": 3,
            "name": "Smallmouth Bass",
            "subtitle": "Micropterus dolomieu",
            "image": {"image": "smallmouthbass",
                "alt": "a green fish with a white body"},
            "flavor": "smallmouth bass are a very popular fish among fishermen. their dedicated article on wikipedia doesn't talk about their mouth once.",
            "rarity": 1,
            "size": "small",
            "price": 4.50
        },
        {
            "id": 4,
            "name": "Channel Catfish",
            "subtitle": " Ictalurus punctatus",
            "image": {"image": "channelcatfish",
                "alt": "a sleek-looking fish with 3 pairs of whiskers (which is incorrect)"},
            "flavor": "Channel Catfish live in channels of water and lack the means to live in channels of any other medium. you may see them in certain tv channels though.",
            "rarity": 1,
            "size": "small",
            "price": 4.0
        },
        {
            "id": 5,
            "name": "Black Crappie",
            "subtitle": "Pomoxis nigromaculatus",
            "image": {"image": "blackcrappie",
                "alt": "a deep green fish covered with black speckles"},
            "flavor": "Black Crappies are one of the two crappie species. Their name comes from the Canadian French \"crapet\" despite what people might first assume.",
            "rarity": 1,
            "size": "small",
            "price": 2.5
        },
        {
            "id": 6,
            "name": "Red drum",
            "subtitle": "Sciaenops ocellatus",
            "image": {"image": "redfish",
                "alt": "a medium size fish with a slightly red body and a pale underside. there is a black spot at the base of its tail"},
            "flavor": "Red drums are one of the many fish that are also known as \"redfish\". They can be identified by the black spot(s) near the base of its tail.",
            "rarity": 2,
            "size": "small",
            "price": 7.25
        },
        {
            "id": 7,
            "name": "Barracuda",
            "subtitle": "Sphyraena barracuda",
            "image": {"image": "barracuda",
                "alt": "a long silvery fish with a sleek, straight body. it has some dark mottling on its upper half"},
            "flavor": "Barracudas are a large predatory fish known for their long body and strong bite. They are made for both eastern and western pools despite what one's heart may believe.",
            "rarity": 2,
            "size": "small",
            "price": 10.25
        },
        {
            "id": 8,
            "name": "Fluke",
            "subtitle": "Paralichthys dentatus",
            "image": {"image": "fluke",
                "alt": "A flat fish with a wide, football-shaped silhouette. both of its eyes are pushed to one side of its body."},
            "flavor": "Flukes are also known as summer flounder. Although they are ambush predators, they are also known to chase their prey if they aren't initially successful",
            "rarity": 1,
            "size": "small",
            "price": 8.0
        },
        {
            "id": 9,
            "name": "Sheepshead",
            "subtitle": "Archosargus probatocephalus",
            "image": {"image": "sheepshead",
                "alt": "A rather pale fish with black stripes. Its head is more bluntly-shaped than other fish."},
            "flavor": "Sheepshead have large blunt teeth like sheep, but they don't really look like sheep. They are not known for their contributations to the wool industry.",
            "rarity": 1,
            "size": "small",
            "price": 6.75
        },
        {
            "id": 10,
            "name": "Striped bass",
            "subtitle": "Morne saxatalis",
            "image": {"image": "stripedbass",
                "alt": "A large fish with a silvery body and black stripes running lengthwise."},
            "flavor": "Striped bass are very popular among fishermen, but some might know it as the rockfish below the northern United States.",
            "rarity": 2,
            "size": "small",
            "price": 11.0
        },
        {
            "id": 11,
            "name": "American eel",
            "subtitle": "Anguilla rostrata",
            "image": {"image": "americaneel",
                "alt": "A long fish that looks more like a brown worm with fins its dorsal, tail, and anal fins are fused into a single fin."},
            "flavor": "The american eel is as slippery as most eels. They are as slippery as a moray even, but they are not as lovely.",
            "rarity": 3,
            "size": "small",
            "price": 28.0
        },
        {
            "id": 12,
            "name": "Tench",
            "subtitle": "Tinca tinca",
            "image": {"image": "tench",
                "alt": "A brown fish with a carp-shaped body. In other words, it looks like a duller goldfish"},
            "flavor": "Tench are also known as the doctor fish because of an old myth that any fish that rubbed against its slimy scales would be cured of diseases.",
            "rarity": 2,
            "size": "small",
            "price": 17.0
        },
        {
            "id": 13,
            "name": "Rainbow Trout",
            "subtitle": "Oncorhynchus mykiss",
            "image": {"image": "rainbowtrout",
                "alt": "A medium-sized fish with a silvery body covered in dots. There is a red stripe running down its body."},
            "flavor": "Rainbow trout can be found all over the United States in a variety of forms and subspecies. This particular one is a coastal rainbow trout.",
            "rarity": 3,
            "size": "small",
            "price": 30.25
        },
        {
            "id": 14,
            "name": "Largemouth bass",
            "subtitle": "Micropterus nigiricans",
            "image": {"image": "largemouthbass",
                "alt": "A fish with broad head and a larger-than-usual mouth. Its mouth isn't that big."},
            "flavor": "You might have seen its fellow Centrarchidae member the smallmouth bass and the bluegill. They tend to pick a fight when fishermen try to reel them in.",
            "rarity": 2,
            "size": "small",
            "price": 32.75
        },
        {
            "id": 15,
            "name": "Sockeye salmon",
            "subtitle": "Oncorhynchus nerka",
            "image": {"image": "sockeyesalmon",
                "alt": "A medium sized fish with a hooked mouth and vibrant red body. Its head and tail are a dark grey."},
            "flavor": "Sockeye salmon look like normal salmon until spawning season, when their body becomes a bright red. During this time, they travel up rivers in droves.",
            "rarity": 3,
            "size": "small",
            "price": 38.0
        }
    ]
}